       class-id Class1.
       
       working-storage section.
       
       method-id InstanceMethod.
       local-storage section.
       procedure division.

           goback.           
       end method.
      
       end class.
