IDENTIFICATION DIVISION.
PROGRAM-ID. F3.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 VALIDE PIC A.
77 WS-CHOIX PIC X.
77 NUM-PILOTE-MAJ PIC 9(3).
77 DEL-PILOTE-MAJ PIC 9(3).

01 NEW-PILOTE.
	02 NEW-NOM PIC X(20).
	02 NEW-PRENOM PIC X(10).
	02 NEW-ADRESSE PIC X(50).
	02 NEW-NBH-VOL PIC 9(6).
	02 NEW-BREVET PIC 9.
	02 NEW-ETATPIL PIC AAA VALUE "ARL".
	
01 MAJ-PILOTE.
	02 MAJ-NOM PIC X(20).
	02 MAJ-PRENOM PIC X(10).
	02 MAJ-ADRESSE PIC X(50).
	02 MAJ-NBH-VOL PIC 9(6).
	02 MAJ-BREVET PIC 9.


	
	
01 FPILOTE.
	02 PILOTE OCCURS 5.
		03 NUMPIL PIC 9(3).
		03 NOM PIC X(20).
		03 PRENOM PIC X(10).
		03 ADRESSE PIC X(50).
		03 NBHVOL PIC 9(6).
		03 ETATPIL PIC AAA.

SCREEN SECTION.
	01 CLRSCREEN BLANK SCREEN.
	01 STDSCREEN BACKGROUND-COLOR 0 FOREGROUND-COLOR 2.
		02 LINE 1 COL 1 VALUE "A".
		
PROCEDURE DIVISION.

MENU.
    DISPLAY CLRSCREEN.
    DISPLAY STDSCREEN.
    DISPLAY "F3" LINE 5 COL 5.
    DISPLAY "1. Afficher la liste des pilotes" LINE 6 COL 5.
    DISPLAY "2. Ajouter un pilote" LINE 7 COL 5.
    DISPLAY "3. Modifier un pilote" LINE 8 COL 5.
    DISPLAY "4. Supprimer un pilote" LINE 9 COL 5.
    DISPLAY "5. Revenir au menu principal" LINE 10 COL 5.
    DISPLAY "6. Quitter le programme" LINE 11 COL 5.
    ACCEPT WS-CHOIX.
	EVALUATE WS-CHOIX
		WHEN 1
			PERFORM LISTE-PILOTE
		WHEN 2
			PERFORM MENU-CRE-PILOTE
		WHEN 3
			PERFORM MENU-MAJ-PILOTE
		WHEN 4
			PERFORM MENU-DEL-PILOTE
		WHEN OTHER 
			PERFORM MENU
	END-EVALUATE.
	

LISTE-PILOTE.
    STOP RUN.


MENU-CRE-PILOTE.
    DISPLAY CLRSCREEN.
	MOVE "ARL" TO ETAT-PILOTE.
    DISPLAY "Ajouter un pilote" LINE 1 COL 30.
    DISPLAY "Nom: " LINE 7 COL 1.
    DISPLAY "Prénom: " LINE 8 COL 1.
    DISPLAY "Adresse: " LINE 9 COL 1.
    DISPLAY "Brevet: " LINE 10 COL 1.
    ACCEPT NEW-NOM LINE 7 COL 15.
    ACCEPT NEW-PRENOM LINE 8 COL 15.
    ACCEPT NEW-ADRESSE LINE 9 COL 15.
    ACCEPT NEW-BREVET LINE 10 COL 15.
    DISPLAY "Valider la création d'un pilote. (y/n)" LINE 21 COL 1.
    ACCEPT VALIDE LINE 22 COL 1.
    IF VALIDE = 'y'
        DISPLAY "Pilote créé" LINE 21 COL 1
    ELSE
        IF VALIDE = 'n'
            DISPLAY "Pilote non créé" LINE 21 COL 1
        ELSE
            DISPLAY "Erreur, commande invalide" LINE 20 COL 1
        END-IF
    END-IF.
    STOP RUN.
    PERFORM MENU.
	
	
MENU-MAJ-PILOTE.
    DISPLAY CLRSCREEN.
    DISPLAY "Modifier un pilote" LINE 1 COL 30.
    
    DISPLAY "Pilote à modifier:" LINE 21 COL 1.
    ACCEPT NUM-PILOTE-MAJ LINE 22 COL 1.
        
    DISPLAY "Nom: " LINE 7 COL 1.
    DISPLAY "Prénom: " LINE 8 COL 1.
    DISPLAY "Adresse: " LINE 9 COL 1.
    DISPLAY "Brevet: " LINE 10 COL 1.
    DISPLAY "Nom" LINE 7 COL 15.
    ACCEPT MAJ-NOM LINE 7 COL 15.
    ACCEPT MAJ-PRENOM LINE 8 COL 15.
    ACCEPT MAJ-ADRESSE LINE 9 COL 15.
    ACCEPT MAJ-BREVET LINE 10 COL 15.
    DISPLAY "Valider la modification d'un pilote. (y/n)" LINE 21 COL 1.
    ACCEPT VALIDE LINE 22 COL 1.
    IF VALIDE = 'y'
        DISPLAY "Pilote modifié" LINE 21 COL 1
    ELSE
        IF VALIDE = 'n'
            DISPLAY "Pilote non modifié" LINE 21 COL 1
        ELSE
            DISPLAY "Erreur, commande invalide" LINE 20 COL 1
        END-IF
    END-IF.
    STOP RUN.
    PERFORM MENU.

  
	

MENU-DEL-PILOTE.
    DISPLAY CLRSCREEN.
    DISPLAY "Supprimer un pilote" LINE 1 COL 30.
    DISPLAY "Pilote à supprimer:" LINE 21 COL 1.
    ACCEPT DEL-PILOTE-MAJ LINE 22 COL 1.
    STOP RUN.
    PERFORM MENU.
    

