IDENTIFICATION DIVISION.
PROGRAM-ID. F4.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
   SELECT FVOL ASSIGN TO 'fvol.dat'.
   SELECT FPILOTE ASSIGN TO 'fpilote.dat'.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
77 VALIDE PIC A.
77 NUM-AVION-MAJ PIC 9(3).
77 NUM-AVION-DEL PIC 9(3).
01 FAVION.
	02 AVION OCCURS 5.
		03 CODAV PIC 9(3).
		03 FILLER PIC X VALUE " ".
		03 CPTHORAV PIC 9(6).
		03 FILLER PIC X VALUE " ".
		03 CPTINTER PIC 9(3).
		03 FILLER PIC X VALUE " ".
		03 INFOS PIC X(50).
		03 FILLER PIC X VALUE " ".
		03 ETATAV PIC A.
		03 FILLER PIC X VALUE " ".
		03 CODTYP PIC XX.

01 FPILOTE.
	02 PILOTE OCCURS 5.
		03 NUMPIL PIC 9(3).
		03 NOM PIC X(20).
		03 PRENOM PIC X(10).
		03 ADRESSE PIC X(50).
		03 NBHVOL PIC 9(6).
		03 ETATPIL PIC AAA.
		
01 FVOL.
  02 VOL OCCURS 8.
    03 NUMVOL PIC 9(6).
    03 DATEDEB PIC X(10).
    03 DATEFIN PIC X(10).
    03 CPTDEP PIC 9(6) VALUE ZEROES.
    03 CPTARR PIC 9(6) VALUE ZEROES.
    03 DESTIN PIC X(25) VALUE SPACES.
    03 ATATVOL PIC A.
    03 NUMAV PIC 9(3).
    03 NUMPIL PIC 9(3).
    03 NBHVOL PIC 9(6) VALUE ZEROES.
    03 COUTVOL PIC 9(6).
	
77 NB-PAGE PIC 99.
77 I PIC 99 VALUE 1.
77 J PIC 99 VALUE 1.
77 VSTART PIC 99.
77 VSTOP PIC 99.
77 USER-VAL PIC X.
77 K PIC 9(3).
77 TARIF PIC 9(3) VALUE 15.
77 WS-CHOIX PIC 9.
77 WS-AVION-SELECT PIC 999.

77 WS-NEW-INFOS PIC X(50).
77 WS-NEW-CPTHORAV PIC 9(6).
77 WS-NEW-CODTYP PIC XX.

77 WS-NEW-CPTINTER PIC 9(3).
77 WS-DEL-AVION PIC 9(3).

SCREEN SECTION.
01 CLEARBODY.
    02 LINE 6 COL 1 VALUE "".
    02 LINE 7 VALUE "".
    02 LINE 8 VALUE "".
    02 LINE 9 VALUE "".
    02 LINE 10 VALUE "".

01 CLRSCREEN BLANK SCREEN.
01 STDSCREEN BACKGROUND-COLOR 0 FOREGROUND-COLOR 2.
    02 LINE 1 COL 1 VALUE "A".
    
PROCEDURE DIVISION.

MENU.
    DISPLAY CLRSCREEN.
    DISPLAY STDSCREEN.
    DISPLAY "F4" LINE 5 COL 5.
    DISPLAY "1. Afficher la liste des avions" LINE 6 COL 5.
    DISPLAY "2. Ajouter un avion" LINE 7 COL 5.
    DISPLAY "3. Modifier un avion" LINE 8 COL 5.
    DISPLAY "4. Supprimer un avion" LINE 9 COL 5.
    DISPLAY "5. Revenir au menu principal" LINE 10 COL 5.
    DISPLAY "6. Quitter le programme" LINE 11 COL 5.
    ACCEPT WS-CHOIX.
    IF WS-CHOIX=1 THEN
        PERFORM LISTE-AVION
    END-IF.
    IF WS-CHOIX=2 THEN
        PERFORM MENU-CRE-AVION
    END-IF.
    IF WS-CHOIX=3 THEN
        PERFORM MENU-MAJ-AVION
    END-IF.
    IF WS-CHOIX=4 THEN
        PERFORM MENU-DEL-AVION
    END-IF.


INFOS-AVION.
    DISPLAY "Information sur l'avion".


LISTE-AVION.
    DISPLAY "Liste des avions" LINE 1 COL 30.
    DISPLAY "Selectionner un avion"
    ACCEPT WS-AVION-SELECT.
    PERFORM INFOS-AVION.


MENU-CRE-AVION.
    DISPLAY CLRSCREEN.
    DISPLAY "Ajouter un avion" LINE 1 COL 30.
    DISPLAY "Infos: " LINE 7 COL 1.
    DISPLAY "Compteur horaire: " LINE 8 COL 1.
    DISPLAY "Type de l'avion: " LINE 9 COL 1.
    ACCEPT WS-NEW-INFOS LINE 7 COL 25.
    ACCEPT WS-NEW-CPTHORAV LINE 8 COL 25.
    ACCEPT WS-NEW-CODTYP LINE 9 COL 25.
    MOVE 0 TO WS-NEW-CPTINTER.
    DISPLAY "Valider la création d'un avion. (y/n)" LINE 21 COL 1.
    ACCEPT VALIDE LINE 22 COL 1.
    IF VALIDE = 'y'
        DISPLAY "Avion créé" LINE 21 COL 1
    ELSE
        IF VALIDE = 'n'
            DISPLAY "Avion non créé" LINE 21 COL 1
        ELSE
            DISPLAY "Erreur, commande invalide" LINE 20 COL 1
        END-IF
    END-IF.
	
MENU-MAJ-AVION.
    DISPLAY CLRSCREEN.
    DISPLAY "Modifier un avion" LINE 1 COL 30.
    DISPLAY "Avion à modifier:" LINE 21 COL 1.
    ACCEPT NUM-AVION-MAJ.
    PERFORM INFOS-AVION.
    DISPLAY "Valider la modification (y/n)?".
    
    ACCEPT WS-CHOIX.
	

MENU-DEL-AVION.
    DISPLAY CLEARBODY.
    DISPLAY "Supprimer un avion" LINE 1 COL 30.
    DISPLAY "Avion à supprimer:" LINE 21 COL 1.
    ACCEPT NUM-AVION-DEL LINE 22 COL.
    DISPLAY "Avion supprimé" LINE 21 COL 1.
    DISPLAY "1. Retourner au menu  2. Quitter" LINE 21 COL 1.
    ACCEPT WS-CHOIX.
    GO TO MENU QUIT DEPENDING ON WS-CHOIX.


QUIT.
    STOP RUN.

