       identification division.
       program-id. F6.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.
           
       end program F6.