IDENTIFICATION DIVISION.
PROGRAM-ID. AEROCLUB.
AUTHOR. HUGO SARACINO.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
    INPUT-OUTPUT SECTION.
DATA DIVISION.
    FILE SECTION.
    WORKING-STORAGE SECTION.
    01  WS_DATE.
        02  WS_DD 	PIC 99.
        02  WS_MM 	PIC 99.
        02  WS_YYYY PIC 9999.
    77  WS_FUNC 	PIC X(25) 	VALUE "MAIN MENU".
    77  WS_LINE 	PIC X(80) 	VALUE "________________________________________________________________________________".
	77	WS_MTITLE	PIC X(80)	VALUE "Veuillez choisir parmis les options suivantes : ".
	77	WS_MENUF0	PIC X(80)	VALUE "    F0 - Liste des avions à réviser et des pilotes malades.".
	77	WS_MENUF1	PIC X(80)	VALUE "    F1 - Dépôt d'un plan de vol.".
	77	WS_MENUF2	PIC X(80)	VALUE "    F2 - Enregistrement d'un vol.".
	77	WS_MENUF3	PIC X(80)	VALUE "    F3 - Mise-à-jour des pilotes.".
	77	WS_MENUF4	PIC X(80)	VALUE "    F4 - Mise-à-jour des avions.".
	77	WS_MENUF5	PIC X(80)	VALUE "    F5 - Récapitulatif des avions.".
	77	WS_MENUF6	PIC X(80)	VALUE "    F6 - Récapitulatif des pilotes.".
	77	WS_MENUF7	PIC X(80)	VALUE "    F7 - Facturation des vols aux pilotes.".
    77  WS_MSG  	PIC X(50) 	VALUE SPACES.
    77  WS_INVITE 	PIC X(50) 	VALUE SPACES.
    77  WS_CHOICE 	PIC X		VALUE SPACES.
	77	WS_CONTINUE PIC 9		VALUE 1.
    SCREEN SECTION.
    01  STDSCREEN BLANK SCREEN.
        02  LINE 3  COL 5 PIC 99 FROM WS_DD.
        02  LINE 3  COL 7 VALUE "/".
        02  LINE 3  COL 8 PIC 99 FROM WS_MM.
        02  LINE 3  COL 10 VALUE "/".
        02  LINE 3  COL 11 PIC 9999 FROM WS_YYYY.
        02  LINE 3  COL 30 VALUE "GESTION AEROCLUB".
        02  LINE 3  COL 50 PIC X(25) FROM WS_FUNC.
        02  LINE 6  PIC X(80) FROM WS_LINE.
		02	LINE 8  PIC X(80) FROM WS_MTITLE.
		02	LINE 9  PIC X(80) FROM WS_MENUF0.
		02	LINE 10 PIC X(80) FROM WS_MENUF1.
		02	LINE 11 PIC X(80) FROM WS_MENUF2.
		02	LINE 12 PIC X(80) FROM WS_MENUF3.
		02	LINE 13 PIC X(80) FROM WS_MENUF4.
		02	LINE 14 PIC X(80) FROM WS_MENUF5.
		02	LINE 15 PIC X(80) FROM WS_MENUF6.
		02	LINE 16 PIC X(80) FROM WS_MENUF7.
		02  LINE 17 VALUE "CHOIX : ".
        02  LINE 17 COL 10 PIC X USING WS_CHOICE.
        02  LINE 19 PIC X(80) FROM WS_LINE.
        02  LINE 20 PIC X(50) FROM WS_MSG.
PROCEDURE DIVISION.
PRINCIPAL SECTION.
	PERFORM UNTIL WS_CONTINUE = 0
		DISPLAY STDSCREEN
		ACCEPT STDSCREEN
		EVALUATE WS_CHOICE
			WHEN "0" CALL "F0" USING WS_CONTINUE
			WHEN "1" CALL "F0" USING WS_CONTINUE
			WHEN "2" CALL "F0" USING WS_CONTINUE
			WHEN "3" CALL "F0" USING WS_CONTINUE
			WHEN "4" CALL "F0" USING WS_CONTINUE
			WHEN "5" CALL "F0" USING WS_CONTINUE
			WHEN "6" CALL "F0" USING WS_CONTINUE
			WHEN "7" CALL "F0" USING WS_CONTINUE
			WHEN "Q" MOVE 0 TO WS_CONTINUE
			WHEN OTHER MOVE "Option invalide." TO WS_MSG
		END-EVALUATE
	END-PERFORM.
	STOP RUN.