IDENTIFICATION DIVISION.
PROGRAM-ID. AEROCLUB.
AUTHOR. HUGO SARACINO.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
    INPUT-OUTPUT SECTION.
DATA DIVISION.
    FILE SECTION.
    WORKING-STORAGE SECTION.
    01  WS_DATE.
        02  WS_DD PIC 99 VALUE 04.
        02  WS_MM PIC 99 VALUE 04.
        02  WS_YYYY PIC 9999 VALUE 2016.
    77  WS_FUNC PIC X(25) VALUE "MAIN".
    77  WS_LINE PIC X(80) VALUE "________________________________________________________________________________".
    77  WS_MSG  PIC X(50) VALUE "MSG".
    77  WS_INVITE PIC X(50) VALUE "INVITE".
    77  WS_COUNT PIC 99 VALUE 10.
    77  WS_CHOICE PIC X VALUE "A".
    SCREEN SECTION.
    01  STDSCREEN BLANK SCREEN.
        02  LINE 3 COL 5 PIC 99 FROM WS_DD.
        02  LINE 3 COL 7 VALUE "/".
        02  LINE 3 COL 8 PIC 99 FROM WS_MM.
        02  LINE 3 COL 10 VALUE "/".
        02  LINE 3 COL 11 PIC 9999 FROM WS_YYYY.
        02  LINE 3 COL 30 VALUE "GESTION AEROCLUB".
        02  LINE 3 COL 50 PIC X(25) FROM WS_FUNC.
        02  LINE 6 PIC X(80) FROM WS_LINE.
        02  LINE 19 PIC X(80) FROM WS_LINE.
        02  LINE 20 PIC X(50) FROM WS_MSG.
        02  LINE 21 PIC X(50) FROM WS_INVITE.
        02  LINE 22 COL 5 VALUE "Il vous reste ".
        02  LINE 22 COL 19 FROM WS_COUNT.
        02  LINE 22 COL 21 VALUE " essai(s).".
        02  LINE 23 VALUE "CHOIX :".
        02  LINE 23 COL 10 PIC X USING WS_CHOICE.
PROCEDURE DIVISION.
PRINCIPAL SECTION.
    DISPLAY STDSCREEN.