IDENTIFICATION DIVISION.
PROGRAM-ID. F2DEV.
AUTHOR. HUGO SARACINO.
ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
    INPUT-OUTPUT SECTION.
DATA DIVISION.
    FILE SECTION.
    WORKING-STORAGE SECTION.
    01  WS_CURR_DATE_FIELDS.
        05  WS_CURR_DATE.
            10  WS_CURR_YEAR    PIC  9(4).
            10  WS_CURR_MONTH   PIC  9(2).
            10  WS_CURR_DAY     PIC  9(2).
        05  WS_CURR_TIME.
            10  WS_CURR_HOUR    PIC  9(2).
            10  WS_CURR_MINUTE  PIC  9(2).
            10  WS_CURR_SECOND  PIC  9(2).
            10  WS_CURR_MS      PIC  9(2).
        05  WS_DIFF_FROM_GMT    PIC S9(4).
    77  WS_FUNC     PIC X(25)   VALUE "ENREGISTREMENT VOL".
    77  WS_LINE     PIC X(80)   VALUE "________________________________________________________________________________".
    77  WS_MTITLE   PIC X(80)   VALUE "Veuillez choisir parmis les options suivantes : ".
    77  WS_MBACK    PIC X(80)   VALUE "    M - Retourner au menu principal.".
    77  WS_MQUIT    PIC X(80)   VALUE "    Q - Quitter l'application.".
    77  WS_MSG      PIC X(50)   VALUE SPACES.
    77  WS_INVITE   PIC X(50)   VALUE "Veuillez saisir l'identifiant de l'avion.".
    77  WS_CHOICE   PIC X       VALUE SPACES.
    77  WS_QUERY    PIC 9(3)    VALUE ZEROES.
    77  WS_CONTINUE PIC 9.
    EXEC SQL
        INCLUDE SQLCA
    END-EXEC.
    EXEC SQL
        INCLUDE AVIONS, VOLS, PILOTES, ETAT_PILOTE
    END-EXEC.
    EXEC SQL BEGIN DECLARE SECTION
    END-EXEC.
        01  WS-VOL-REC.
            05  WS-VOL-ID           PIC 9(6).
            05  WS-VOL-CPTDEP       PIC 9(6).
            05  WS-VOL-CPTARR       PIC 9(6).
            05  WS-VOL-ETAT         PIC X.
        01  WS-AVION-REC.
            05  WS-AVION-ID         PIC 9(3).
            05  WS-AVION-CPTHORAV   PIC 9(6).
            05  WS-AVION-CPTINTER   PIC 9(6).
        01  WS-PILOTE-REC.
            05  WS-PILOTE-ID        PIC 9(3).
            05  WS-PILOTE-NBHVOL    PIC 9(6).
        01  WS-ETATPILOTE-REC.
            05  WS-ETATPILOTE-ID    PIC 9(2).
            05  WS-SANTEPILOTE      PIC X.
            05  WS-FINANCESPILOTE   PIC X.
            05  WS-DISPOPILOTE      PIC X.
    EXEC SQL END DECLARE SECTION
    END-EXEC.
    LINKAGE SECTION.
    77  LS_CONTINUE PIC 9.
    SCREEN SECTION.
    01 CLRSCREEN BLANK SCREEN.
    01  STDSCREEN BACKGROUND-COLOR 0 FOREGROUND-COLOR 2.
        02  LINE 3  COL 5 PIC 9(2) FROM WS_CURR_DAY.
        02  LINE 3  COL 7 VALUE "/".
        02  LINE 3  COL 8 PIC 9(2) FROM WS_CURR_MONTH.
        02  LINE 3  COL 10 VALUE "/".
        02  LINE 3  COL 11 PIC 9(4) FROM WS_CURR_YEAR.
        02  LINE 3  COL 30 VALUE "GESTION AEROCLUB".
        02  LINE 3  COL 50 PIC X(25) FROM WS_FUNC.
        02  LINE 6  COL 1 PIC X(80) FROM WS_LINE.
        02  LINE 8  COL 1 PIC X(80) FROM WS_MTITLE.
        02  LINE 9  COL 1 PIC X(80) FROM WS_MBACK.
        02  LINE 10 COL 1 PIC X(80) FROM WS_MQUIT.
        02  LINE 18 COL 1 PIC X USING WS_CHOICE.
        02  LINE 19 COL 1 PIC X(80) FROM WS_LINE.
        02  LINE 20 COL 1 PIC X(50) FROM WS_MSG.
        02  LINE 21 COL 1 PIC X(50) FROM WS_INVITE.
        02  LINE 22 COL 1 PIC 9(3) USING WS_QUERY.
PROCEDURE DIVISION USING LS_CONTINUE.
PRINCIPAL SECTION.
PGM_F2.
    PERFORM INIT_F2.
    PERFORM UNTIL WS_CONTINUE = 0
        PERFORM REFRESH_SCREEN_F2
        IF WS_QUERY <> 0 THEN
            MOVE SPACES TO WS_CHOICE
            PERFORM QUERY_F2
            PERFORM ERROR_HANDLING_F2
        ELSE
            EVALUATE WS_CHOICE
                WHEN SPACES
                    MOVE SPACES TO WS_MSG.
                WHEN "M" 
                    MOVE 0 TO WS_CONTINUE 
                WHEN "Q" 
                    MOVE 0 TO WS_CONTINUE, LS_CONTINUE
                WHEN OTHER 
                    MOVE "Option invalide." TO WS_MSG
            END-EVALUATE
            MOVE SPACES TO WS_CHOICE
        END-IF
    END-PERFORM.
END_F2.
    STOP RUN.
INIT_F2.
    MOVE FUNCTION CURRENT-DATE TO WS_CURR_DATE_FIELDS.
    MOVE 1 TO WS_CONTINUE.
    MOVE SPACES TO WS_CHOICE.
    MOVE ZEROES TO WS_QUERY.
REFRESH_SCREEN_F2.
    DISPLAY CLRSCREEN
    DISPLAY STDSCREEN
    ACCEPT STDSCREEN
QUERY_F2.
    EXEC SQL
        SELECT  N__VOL, COMPTEUR_DEPART, COMPTEUR_ARRIVEE, ETAT_VOL,
                N__AVION, COMPTEUR_HORAIRE, COMPTEUR_INTERMEDIAIRE,
                N__PILOTE, NB_HEURES_VOL, N__ETAT_PILOTE,
                SANTE_PILOTE, FINANCES_PILOTE, DISPONIBILITE_PILOTE
        INTO    :WS-VOL-ID, :WS-VOL-CPTDEP, WS-VOL-CPTARR, WS-VOL-ETAT,
                WS-AVION-ID, WS-AVION-CPTHORAV, WS-AVION-CPTINTER,
                WS-PILOTE-ID, WS-PILOTE-NBHVOL, WS-ETATPILOTE-ID,
                WS-SANTEPILOTE, WS-FINANCESPILOTE, WS-DISPOPILOTE
        FROM    AVIONS INNER JOIN VOLS INNER JOIN PILOTES INNER JOIN ETAT_PILOTE
        ON      AVIONS.N__AVION = VOL.N__AVION,
                VOL.N__PILOTE = PILOTES.N__PILOTE,
                PILOTES.N__ETAT_PILOTE = ETAT_PILOTE.N__ETAT_PILOTE
        WHERE   N__AVION = WS_QUERY
                AND ETAT_VOL = 'D'
    END-EXEC.
ERROR_HANDLING_F2.
    IF SQLCODE = 0 THEN
        MOVE "Requête effectué avec succès." TO WS_MSG
        PERFORM UPDATEDB_F2
    ELSE
        MOVE "Erreur." TO WS_MSG
    END-IF.
UPDATEDB_F2.
    MOVE 'T' TO WS-VOL-ETAT.
    MOVE 'L' TO WS-DISPOPILOTE.
    MOVE FUNCTION CURRENT-DATE (9:6) TO WS-VOL-CPTARR.
    COMPUTE WS_TPSVOL = WS-VOL-CPTARR - WS-VOL-CPTDEP.
    ADD WS_TPSVOL TO WS-AVION-CPTHORAV.
    ADD WS_TPSVOL TO WS-AVION-CPTINTER.
    ADD WS_TPSVOL TO WS-PILOTE-NBHVOL.
    EXEC SQL
        UPDATE  VOLS
        SET     COMPTEUR_ARRIVEE = :WS-VOL-CPTARR,
                ETAT-VOL = :WS-VOL-ETAT
        WHERE   N__VOL = :WS-VOL-ID
    END-EXEC.
    EXEC SQL
        UPDATE  AVIONS
        SET     COMPTEUR_HORAIRE = :WS-AVION-CPTHORAV
                COMPTEUR_INTERMEDIAIRE = :WS-AVION-CPTINTER
        WHERE   N__AVION = :WS-AVION-ID
    END-EXEC.
    EXEC SQL
        UPDATE  PILOTES
        SET     NB_HEURES_VOL = :WS-PILOTE-NBHVOL
        WHERE   N__PILOTE = :WS-PILOTE-ID
    END-EXEC.
    EXEC SQL
        UPDATE  ETAT_PILOTE
        SET     DISPONIBILITE_PILOTE = :WS-DISPOPILOTE
        WHERE   N__ETAT_PILOTE = :WS-ETATPILOTE-ID
    END-EXEC.