IDENTIFICATION DIVISION.
PROGRAM-ID. TEMPLATE.

DATA DIVISION.
   LINKAGE SECTION.
   01 LS-STUDENT-ID PIC 9(4).
   01 LS-STUDENT-NAME PIC A(15).

WORKING-STORAGE SECTION.

SCREEN SECTION.
    01 CLRSCREEN BLANK SCREEN.
    01  STDSCREEN BACKGROUND-COLOR 0 FOREGROUND-COLOR 2.
        02  LINE 3  COL 5 PIC 9(2) FROM WS_CURR_DAY.
        02  LINE 3  COL 7 VALUE "/".
        02  LINE 3  COL 8 PIC 9(2) FROM WS_CURR_MONTH.
        02  LINE 3  COL 10 VALUE "/".
        02  LINE 3  COL 11 PIC 9(4) FROM WS_CURR_YEAR.
        02  LINE 3  COL 30 VALUE "GESTION AEROCLUB".
        02  LINE 3  COL 50 PIC X(25) FROM WS_FUNC.
        02  LINE 6  COL 1 PIC X(80) FROM WS_LINE.
        02  LINE 8  COL 1 PIC X(80) FROM WS_MTITLE.
        02  LINE 9  COL 1 PIC X(80) FROM WS_MBACK.
        02  LINE 10 COL 1 PIC X(80) FROM WS_MQUIT.
        02  LINE 19 COL 1 PIC X(80) FROM WS_LINE.
        02  LINE 20 COL 1 PIC X(50) FROM WS_MSG.
        02  LINE 21 COL 1 PIC X(50) FROM WS_INVITE.
        02  LINE 22 COL 1 VALUE "> ".
        02  LINE 22 COL 3 PIC X USING WS_CHOICE.
		
PROCEDURE DIVISION USING LS-STUDENT-ID, LS-STUDENT-NAME.
   DISPLAY CLRSCREEN.
   DISPLAY STDSCREEN.
EXIT PROGRAM.